<?php

if (! function_exists('faker')) {
    function faker($number = 1)
    {
        $text = '
احتمالاً شما هم هرچقدر حافظه تان را زیر و رو کنید چیزی از آنر ویو 10 به یاد نمی آورید. این گوشی پرچمدار حدود یک سال قبل معرفی شد و با سخت افزار قدرتمند و قیمت فوق العاده رقابتی در بازارهای جهانی نسبتاً خوش درخشید. اما یک عنصر اساسی به نام «تمایز» را کم داشت. حالا آنر سنگ تمام گذاشته تا آنر ویو 20 در دنیای موبایل ماندگار شود.

روند معرفی آنر ویو 20 هم در نوع خودش جالب توجه است. این گوشی ابتدا نوزدهم آذر ماه در رویدادی در هنگ کنگ به نمایش درآمد. سپس پنجم دی ماه به شکل رسمی در چین معرفی شد و نهایتاً دوم بهمن ماه در رویدادی در پاریس به شکل جهانی عرضه شد. ما چند روز قبل در دفتر آنر این گوشی را از نزدیک ملاقات کردیم و حالا همزمان با عرضه جهانی. نسخه نهایی آنر ویو 20 به دستمان رسیده است تا نگاه دقیق تری به آن داشته باشیم.

آنر ویو 20 که به آنر V20 هم معروف است. اختلاف قابل توجهی با نسل قبل دارد. یعنی هرچقدر آنر V10 کلاسیک و معمولی بود. آنر V20 متمایز و بدیع است. نمایشگر بدون حاشیه. نورپردازی جذاب پشت بدنه. دوربین اصلی 48 مگاپیکسلی و البته حفره دوربین سلفی داخل نمایشگر تنها بخشی از ویژگی های جذاب این گوشی هستند.

البته بسته بندی آنر ویو 20 به اندازه خود گوشی جذاب نیست. آنر فقط تجهیزات ضروری یعنی خود گوشی. شارژر 22.5 واتی. کابل شارژ مخصوص و یک کاور سیلیکونی شفاف را داخل جعبه ای ساده قرار داده. بله. خبری از هدفون نیست. همچنین صفحه نمایش آنر ویو 20 در حالت خاموش جذابیتی ندارد و بهتر بود در نگاه اول با پشت بدنه و رنگ بندی هیجان انگیزش روبرو می شدیم. در ادامه با بررسی گوشی پرچمدار آنر ویو 20 با دیجیاتو همراه باشید.

آرزوی ساخت نمایشگر بدون حاشیه به تولد فرزند ناخواسته ای منجر شد که هیچکس مسئولیتش را بر عهده نمی گیرد. ابتدا اسنشال آتش را روشن کرد و بعد اپل با قدرت در آن دمید تا اکنون شاهد انواع و اقسام بریدگی نمایشگر یا همان ناچ در دنیای موبایل باشیم؛ از مستطیل و ذوزنقه متساوی الساقین معکوس گرفته تا گرد و قطره ای شکل. بعضی شرکت ها هم برای جا دادن دوربین سلفی و سنسورهای جلوی بدنه دست به دامن طراحی کشویی چند سال قبل شدند (مانند آنر مجیک 2). حالا در سال 2019 شاهد پدیده ای به نام حفره دوربین سلفی هستیم.

حتماً تا اینجا متوجه شده اید که من با هرگونه بریدگی نمایشگر مخالفم و ترجیح می دهم حاشیه بالا و پایین نمایشگر یکسان باشند. ولی بیایید در مورد تبحر و تهور آنر در طراحی و ساخت آنر ویو 20 صحبت کنیم. شکی نیست که آنر V20 با بدنه تمام شیشه ای و فریم آلومینیومی. محصولی زیبا و خیره کننده است ولی در نگاه اول. حفره داخل نمایشگر جلب توجه می کند. تیم طراحی و مهندسی آنر با ماه ها تحقیق و توسعه و ثبت پنج پتنت مختلف. توانستند اندازه این حفره را به 4.5 میلیمتر برسانند که فعلاً کوچک ترین نمونه در دنیای موبایل است. به همین دلیل و برخلاف تصور اولیه من. این حفره مزاحمت چندانی در هنگام استفاده از گوشی ایجاد نمی کند.

پس از تعیین تکلیف دوربین سلفی. نوبت به اسپیکر مکالمه و سنسورهای نور و مجاورت می رسد. اسپیکر مکالمه با ظرافت تمام در مرز فریم اصلی و شیشه روی نمایشگر قرار گرفته و به لطف لایه محافظ نصب شده روی نمایشگر. متوجه شدیم حسگرها هم سمت راست حاشیه بالای صفحه پنهان شده اند. بدون شک تعبیه هیچکدام از این قطعات در طراحی تمام صفحه آنر ویو 20 کار ساده ای نبوده و باید به آنر تبریک بگوییم. روی لبه بالایی شاهد حضور دلچسب جک 3.5 میلیمتری هدفون هستیم و بلندگوی اصلی هم کنار درگاه USB-C روی لبه پایینی قرار گرفته است.

جذابیت آنر ویو 20 در پشت بدنه بیشتر هم می شود. برخلاف دیگر موبایل های شیشه ای. آنر سلیقه به خرج داده و تکنیک خاصی به نام Aurora Nanotexture را برای نورپردازی به کار گرفته است. به گونه ای که با جابجایی گوشی زیر نور. آبشاری از حرف V در برابر چشمان شما به حرکت در می آید. زیبایی این الگو در رنگ های آبی و قرمز فانتوم به اوج می رسد و به راحتی می تواند آنر ویو 20 را از دیگر گوشی های بازار متمایز کند. به شرط آنکه از قاب های محافظ شفاف استفاده کنید.

آنر در بخش نمایشگر اعتقادی به بازی با اعداد نداشته و به یک صفحه IPS LCD با رزولوشن فول اچ دی پلاس در آنر ویو 20 بسنده کرده است. این نمایشگر 6.4 اینچی با رزولوشن 2310×1080 و تراکم 398 پیکسل در هر اینچ به اندازه کافی شفاف و باکیفیت است که هیچوقت نیاز به رزولوشن بالاتر را احساس نخواهید کرد. مگر اینکه به مقایسه گوشی های مختلف علاقه مند باشید. بسته به سلیقه خودتان می توانید از طریق منوی تنظیمات. فضای رنگی نمایشگر را بین دو حالت Vivid و Normal و همچنین دمای رنگ را تنظیم کنید.

نمایشگر آنر ویو 20 از نظر روشنایی هم رضایت شما را برآورده می کند. اندازه گیری های ما نشان داد حداکثر روشنایی این پنل IPS به حدود 490 نیت می رسد که برای اکثر شرایط نوری کافیست و فقط زیر تابش مستقیم خورشید باید کمی زحمت بکشید تا محتوای صفحه را ببینید. البته در دنیای موبایل پنل های LCD بهتری از نظر حداکثر روشنایی و دقت رنگ را در آیفون XR. هواوی میت 20. ال جی G7 و دیگران دیده ایم.

یکی از معدود مشکلات آنر ویو 20 در بخش نمایشگر به چشم می خورد. لبه پایینی صفحه به دلیل نامعلومی سایه افتاده و تار شده که اگر نسبت به آن حساس شوید. شما را آزار خواهد داد. این سایه روشن ها با شدت کمتری در سه طرف دیگر صفحه و همچنین اطراف حفره دوربین سلفی هم دیده می شوند. همان طور که در تصویر بالا می بینید. احتمالاً آنر در مدیریت بک لایت و نشت نور با مشکل مواجه شده است. امیدوارم این مشکل فقط محدود به نمونه ای که در اختیار ما قرار گرفته باشد و شما با آن روبرو نشوید.

آنر  ویو 20 با اندروید 9.0 به دست شما می رسد ولی منتظر طعم دلنشین پای گوگل نباشید. چون باید با رابط کاربری جدیدی به نام Magic UI 2.0.1 کار کنید. حالا چرا مجیک؟ شاید چون برای اولین بار روی گوشی آنر مجیک 2 نصب شده وگرنه خیلی اهل شعبده بازی نیست. اسم را که کنار بگذاریم. در واقع با همان EMUI روبرو هستیم که پیش از این روی هواوی میت 20 پرو (بررسی دیجیاتو) دیده بودیم. بنابراین اگر قبلاً با گوشی های آنر یا هواوی کار کرده اید. به راحتی می توانید از آنر ویو 20 هم استفاده نمایید. احتمالاً در نسخه های بعدی شاهد تفاوت های بیشتری بین این دو پوسته اختصاصی باشیم.

مجیک UI همانند اموشن UI قابلیت های شخصی سازی متعددی دارد و تقریباً همه چیز را می توانید در آن تغییر دهید. تم های مختلف تعبیه شده درون دستگاه زمانی ارزشمندتر می شود که پس از راه اندازی اولیه با یک خرس بزرگ در پس زمینه مواجه شوید. خرسی که به شرکت ایتالیایی موسکینو (Moschino) تعلق دارد. حال اینکه شرکت مورد بحث چه نقش دیگری در طراحی نسخه ویژه آنر ویو 20 داشته را نمی دانیم.

یکی از جذابیت های اندروید 9 کنترل کامل گوشی با ژست های حرکتی است و در آنر ویو 20 هم می توانید این حالت را از منوی تنظیمات فعال کنید. پاسخگویی رابط کاربری به ژست های حرکتی کاملاً سریع و روان است. با سوایپ از لبه پایینی به بالا به صفحه هوم بر می گردید. با سوایپ و نگه داشتن به منوی مالتی تسکینگ وارد می شوید و با سوایپ از لبه های چپ و راست به داخل هم یک گام به عقب بر می گردید. سوایپ از گوشه های پایین نمایشگر به سمت بالا هم دستیار گوگل را فراخوانی می کند.

اگر حفره داخل نمایشگر روی اعصابتان می رود. می توانید از طریق منوی تنظیمات به قسمت Notch رفته و حالت Hide notch را انتخاب کنید تا نوار مشکی رنگی به ضخامت کمتر از یک سانتیمتر بالای صفحه را در بر بگیرد. البته حتی با این کار هم حاشیه بالا و پایین صفحه یکسان نمی شود. ولی سؤال اصلی اینجاست که چرا آنر هنوز این حفره را ناچ می نامد؟

اگرچه آنر ویو 20 به حسگر اثر انگشت سریع و دقیقی در پشت بدنه مجهز شده. اما فیس آنلاک هم به شکل لذت بخشی روی این گوشی کار می کند. اگر در منوی تنظیمات حالت Raise to Wake را فعال کنید. به محض برداشتن گوشی. عملیات قفل گشایی همزمان با روشن شدن صفحه یا حتی زودتر از آن انجام می شود. یعنی عملاً موبایل را که بر می دارید وارد صفحه هوم می شوید. البته بدیهیست که امنیت این فناوری به حسگر اثر انگشت یا سیستم تشخیص چهره آیفون نمی رسد.

مجیک UI را نمی توان ساده ترین و زیباترین رابط کاربری اختصاصی در دنیای اندروید دانست (به خصوص اگر وان UI را تجربه کرده باشید) ولی طی سال های اخیر همواره شاهد پیشرفت و بهینه تر شدن آن بوده ایم. در حال حاضر هیچ ایراد خاصی نمی توان از رابط کاربری آنر ویو 20 گرفت و پسندیدن آن صرفاً به سلیقه کاربر بر می گردد.


اگر هواوی میت 20 پرو را قوی ترین گوشی اندرویدی حال حاضر بازار می دانید. وقتش رسیده که با ابرقدرت جدیدی آشنا شوید. آنر ویو 20 همانند سری میت 20 هواوی به اولین چیپست 7 نانومتری دنیای موبایل یعنی Kirin 980 مجهز شده و با 6/8 گیگابایت رم و 128/256 گیگابایت فضای ذخیره سازی وارد بازار می شود. ما قوی ترین مدل را با 8 گیگابایت رم و 256 گیگابایت حافظه داخلی دریافت کردیم. نیازی به گفتن نیست که این پیکربندی سخت افزاری تا مدت ها از پس تمام نیازهای شما بر می آید.

در مورد پیشرفت های چشمگیر چیپست Kirin 980 نسبت به نسل قبل در تمام حوزه های پردازشی. قبلاً صحبت کرده ایم و نیازی به تکرار آنها نیست. در آنر ویو 20 شاهد قابلیت GPU Turbo 2.0 هستیم که تعداد محدودی از بازی ها را با نرخ 60 فریم بر ثانیه اجرا می کند. ولی مهم تر از آن سیستم خنک سازی پیشرفته با لوله های حرارتی است که حتی در زمان پردازش های سنگین و بازی های طولانی هم گوشی را خنک نگه می دارد. این سیستم واقعاً کار می کند. چون ما حدود یک ساعت مداوم آسفالت 9 را بازی کردیم و فقط شاهد گرم شدن قسمت هایی از لبه سمت چپ و حسگر اثر انگشت بودیم.

همانند همیشه برای سنجش توان سخت افزاری آنر ویو 20 به سراغ چهار تست اصلی یعنی آنتوتو. گیکبنچ. پی سی مارک و تری دی مارک رفتیم که نتایج به دست آمده را در تصویر زیر می بینید.
نتایج بنچمارک آنر ویو 20 در حالت استاندارد

همان طور که انتظار می رود. نتایج به دست آمده توسط آنر ویو 20 کاملاً نزدیک به میت 20 پرو است. برای مقایسه. میت 20 پرو در تست های آنتوتو. گیکبنچ تک هسته ای. گیکبنچ چند هسته ای. پی سی مارک. اسلینگ شات اکستریم و اسلینگ شات اکستریم آنلیمیتد به ترتیب امتیازات 274986. 3351. 9885. 7747. 3579 و 3556 را به دست آورده است؛ اما این تمام ماجرا نیست.

در منوی تنظیمات باتری گزینه ای به نام Performance Mode دیده می شود که شاید در نگاه اول چندان کاربردی به نظر نرسد. ولی کارآیی گوشی را به شدت افزایش می دهد. ما این حالت را فعال کرده و دوباره تست های فوق را اجرا نمودیم که نتیجه را در زیر می بینید.

همان طور که می بینید فعال کردن حالت پرفرمنس. کارآیی آنر ویو 20 را به طور میانگین تا 15 درصد افزایش می دهد. البته احتمالاً هیچگاه به این توان اضافه نیاز نخواهید داشت. چون سخت افزار این گوشی در حالت عادی هم به اندازه کافی قدرتمند است. با این حساب می توان آنر ویو 20 را قوی ترین گوشی حال حاضر دنیای اندروید نامید؛ حداقل تا وقتی که محصولات مجهز به اسنپدراگون 855 به شکل گسترده وارد بازار نشده اند.

از نظر امکانات ارتباطی هر آنچه از یک پرچمدار سال 2019 انتظار دارید در آنر ویو 20 هم تعبیه شده است (به جز ارتباط 5G که هنوز تکلیفش مشخص نیست). این گوشی دو درگاه نانو سیم کارت دارد و از کارت حافظه پشتیبانی نمی کند. که به خاطر حجم بالای حافظه داخلی نیازی هم به آن احساس نمی شود. آنتن سه گانه وای فای. پایداری ارتباط شبکه و اینترنت شما را در تمام شرایط تضمین می کند و GPS دوبانده هم موقعیت یابی دقیق تری را در محیط های شلوغ فراهم می سازد (آنر می گوید 10 برابر دقیق تر که ادعای بزرگیست و درست به نظر نمی رسد).

آنر ویو 20 برای پخش صدا فقط از اسپیکر اصلی که روی لبه پایینی تعبیه شده استفاده می کند و متأسفانه خبری از پخش صدای استریو نیست. با این حال کیفیت و بلندی صدای اسپیکر اصلی کاملاً قابل قبول است و می توانید در محیط های شلوغ هم روی آن حساب کنید. شاید بهتر بود آنر فقدان اسپیکر استریو را با قرار دادن یک هدفون باکیفیت درون جعبه جبران می کرد. اما احتمالاً مسئولین این شرکت حساب جیبشان را کرده اند و هزینه خرید هدفون را به دوش شما گذاشته اند.


به بخش جذاب دوربین رسیدیم. جایی که برای اولین بار شاهد ترکیب حسگر 48 مگاپیکسلی جدید سونی و حسگر سه بعدی ToF (زمان پرواز) در آنر ویو 20 هستیم. دوربین اصلی 48 مگاپیکسلی که فعلاً بالاترین رزولوشن را در دنیای موبایل دارد. از فناوری pixel binning بهره می برد تا با ترکیب هر چهار پیکسل. تصویر 12 مگاپیکسلی باکیفیت تری را تولید کند. حسگر ToF هم از نور فروسرخ برای اسکن سه بعدی محیط. اجسام مختلف و همچنین تشخیص سوژه های انسانی در قاب تصویر استفاده می کند.

قبل از بررسی کیفیت دوربین. ابتدا سری به رابط کاربری دوربین می زنیم. اگر قبلاً با گوشی های هواوی و آنر کار کرده اید. با رابط کاربری دوربین آنر ویو 20 هم مشکلی ندارید. حالت های مختلف به شکل نواری در پایین صفحه تعبیه شده و از بالای صفحه هم می توانید به منوی تنظیمات و چند قابلیت کاربردی دیگر از جمله عکاسی هوشمند دست پیدا کنید. حالت حرفه ای. سوپر اسلوموشن. پانوراما و چند گزینه دیگر هم با فشردن دکمه More در دسترس شما قرار گرفته اند.

رزولوشن دوربین آنر ویو 20 به شکل پیش فرض روی 12 مگاپیکسل قرار گرفته. یعنی حالت Pixel Binning فعال است و هر 4 پیکسل حسگر در نقش یک پیکسل مؤثر عمل می کنند. از طریق منوی تنظیمات می توانید رزولوشن را به 48 مگاپیکسل افزایش دهید اما در این حالت. قابلیت زوم هیبریدی 2 برابری را از دست می دهید. در دو تصویر زیر مقایسه عکس 12 مگاپیکسلی (سمت راست) و 48 مگاپیکسلی (سمت چپ) را در اندازه عادی و برش 100 درصد می بینید.

همان طور که می بینید جزئیات تصاویر فوق العاده هستند. عکس 48 مگاپیکسلی طبیعتاً وضوح بالاتری دارد و به شما اجازه کراپ بیشتری می دهد. در واقع بزرگنمایی 2 برابری آنر ویو 20 هم فقط عکس 48 مگاپیکسلی را کراپ می کند و خروجی 12 مگاپیکسلی را تحویل شما می دهد. در زیر مقایسه عکس 12 مگاپیکسلی با بزرگنمایی دو برابری (سمت راست) و عکس 48 مگاپیکسلی را می بینید.

البته پس از ثبت عکس های مختلف با آنر ویو 20 به این نتیجه رسیدیم که همان رزولوشن 12 مگاپیکسلی برای عکاسی کفایت می کند و نیازی نیست با انتخاب حالت 48 مگاپیکسل حجم عکس ها را چند برابر کنیم. در ادامه چند عکس دیگری که با رزولوشن 12 مگاپیکسلی و در شرایط مختلف توسط این گوشی ثبت شده اند را می بینید.


تصاویر ثبت شده با آنر ویو 20 در تمامی شرایط واقعاً دلنشین هستند و از آنجا که هنر عکاسی شما بهتر از من است. می توانید عکس های حرفه ای تری بگیرید. گفتنیست آنر قرار است حالت ویژه ای به نام AI Ultra Clarity را با آپدیت نرم افزاری به این گوشی اضافه کند تا کیفیت عکس های 48 مگاپیکسلی را تا حد زیادی ارتقاء دهد.

قبلاً هم گفتیم که در محیط کم نور. اندازه پیکسل ها نقش تعیین کننده ای دارند و به همین دلیل عکس های 12 مگاپیکسلی آنر ویو 20 در شب (با تکیه بر فناوری Pixel Binning) به مراتب بهتر از عکس های 48 مگاپیکسلی هستند. در زیر می توانید این دو حالت را با یکدیگر مقایسه کنید.

البته همان طور که می بینید در هر دو عکس شاهد نویز بیش از اندازه هستیم. مشخص نیست چرا گوشی های هوشمند تلاش می کنند تا شب را مثل روز روشن کنند. برای عکاسی شبانه. همچنان بهتر است هوش مصنوعی را کنار بگذارید و خودتان دست به کار شوید. به لطف سیستم لرزشگیر حرفه ای آنر ویو 20 می توانید تا یک ثانیه روی دست عکس بدون لرزش بگیرید.


حالت پرتره با دوربین اصلی و دوربین سلفی عملکرد قابل قبولی دارد. هرچند انتظار می رفت به خاطر سنسور ToF سه بعدی پشت دستگاه. پرتره های بهتری را با دوربین اصلی شاهد باشیم. حالت اپرچر یا عمق میدان مصنوعی هم به شکل آزمون و خطا عمل می کند ولی با چند بار عکس گرفتن می توانید به نتیجه مطلوب برسید. در ادامه چند نمونه عکس را مشاهده کنید.


آنر ویو 20 تجهیزات کامل را برای عکاسی حرفه ای در اختیار دارد و در شرایط نوری مناسب عکس های فوق العاده ای می گیرد. فقط باید کمی با آن کار کنید تا بهترین تنظیمات در شرایط مختلف دستتان بیاید. همان طور که گفتیم خیلی نمی شود روی هوش مصنوعی برای عکاسی حساب کرد. به خصوص در محیط کم نور که اکثراً با روشنایی (و نویز) بیش از حد روبرو هستیم. حسگرهای ToF سه بعدی هم فعلاً کاربرد زیادی ندارند و باید صبر کرد تا اپلیکیشن ها و بازی هایی برای به کار گیری آنها به بازار بیایند.


باتری 4000 میلی آمپر ساعتی تعبیه شده در آنر ویو 20 خیال شما را بابت شارژدهی گوشی راحت می کند. این باتری توانست 13 ساعت تمام زیر تست سنگین پی سی مارک و پردازش های متوالی دوام بیاورد. که در دنیای پرچمداران رقم کم سابقه ای است. با این حساب می توانید روی یک و نیم الی دو روز شارژدهی آنر ویو 20 حساب کنید. با فعال کردن حالت کاهش مصرف انرژی قطعاً این رقم فراتر خواهد رفت.

برای چنین باتری قدرتمندی. فناوری شارژ سریع از واجبات است و آنر خوشبختانه شارژر 22.5 واتی را درون جعبه آنر ویو 20 قرار داده است. با این شارژر و البته کابل مخصوص. می توانید گوشی را طی 30 دقیقه تا 59 درصد و طی 80 دقیقه به طور کامل پر کنید. فقدان فناوری شارژ وایرلس یکی دیگر از معدود ایرادات آنر ویو 20 محسوب می شود که البته شاید به خاطر شارژ سریع. بتوان از آن چشم پوشی کرد.


آنر ویو 20 را می توان بهترین گوشی ساخت آنر تا به امروز دانست؛ محصولی که با قیمت مناسب و ویژگی های متمایز. پرچمداران حال حاضر دنیای موبایل را به راحتی به چالش می کشد. در این گوشی برای اولین بار شاهد نورپردازی هدفمند و چشم نواز بدنه شیشه ای هستیم. ضمن اینکه ناچ عجیب و غریب هم جای خودش را به حفره ای داده که تحملش ساده تر است. به احتمال زیاد در سال 2019 میلادی شاهد طراحی های مشابه آنر ویو 20 در دنیای موبایل خواهیم بود.

از سخت افزار فوق العاده قدرتمند آنر ویو 20 که بگذریم. باید به دوربین های حرفه ای آن اشاره کنیم. حسگر 48 مگاپیکسلی جدید سونی در این گوشی عملکرد فوق العاده ای دارد و عکس های جذابی می گیرد. فقط برای عکاسی شبانه باید به کمکش بروید. حسگر ToF سه بعدی هم می تواند زمینه ساز نسل جدیدی از اپلیکیشن ها و بازی ها باشد که تعامل میان کاربر و گوشی را وارد مرحله تازه ای می کند. در ادامه نقاط قوت و ضعف آنر ویو 20 را با هم مرور می کنیم.        
        ';
        $paragraphs = array_filter(explode(PHP_EOL, $text));
        $sentences = array_filter(explode('.', $text));
        $words = array_filter(explode(' ', $text));
        $province = [
            'آذربایجان شرقی', 'آذربایجان غربی', 'اردبیل', 'اصفهان', 'البرز', 'ایلام', 'بوشهر',
            'تهران', 'خراسان جنوبی', 'خراسان رضوی', 'خراسان شمالی', 'خوزستان', 'زنجان', 'سمنان',
            'سیستان و بلوچستان', 'فارس', 'قزوین', 'قم', 'لرستان', 'مازندران', 'مرکزی', 'هرمزگان',
            'همدان', 'چهارمحال و بختیاری', 'کردستان', 'کرمان', 'کرمانشاه', 'کهگیلویه و بویراحمد',
            'گلستان', 'گیلان', 'یزد',
        ];

        $cities = [
            'تهران',
            'مشهد',
            'اصفهان',
            'کرج',
            'شیراز',
            'تبریز',
            'قمقم',
            'اهواز',
            'شاه',
            'ارومیه',
            'رشت',
            'زاهدان',
            'همدان',
            'کرمان',
            'یزد',
            'اردبیل',
            'بندرعباس',
            'اراک',
            'اسلام‌شهر',
            'زنجان',
            'سنندج',
            'قزوین',
            'خرم‌آباد',
            'گرگان',
            'ساری',
            'شهریار',
            'قدس',
            'کاشان',
            'ملارد',
            'دزفول',
            'نیشابور',
            'بابل',
            'خمینی‌شهر',
            'سبزوار',
            'بروجرد',
'آمل',
'پاکدشت',
'نجف‌آباد',
'آبادان',
'قرچک',
'بجنورد',
'ورامین',
'بوشهر',
'ساوه',
'قائم‌شهر',
'بیرجند',
'نسیم‌شهر',
'سیرجان',
'خوی',
'ایلام',
'بوکان',
'شهرکرد',
'سمنان',
'فردیس',
'مراغه',
'شاهین‌شهر',
'ملایر',
'مهاباد',
'سقز',
'بندر ماهشهر',
'رفسنجان',
'گنبد کاووس',
'شاهرود',
'مرودشت',
'کمال‌شهر',
'جهرم',
'تربت حیدریه',
'مریوان',
'اندیمشک',
'شهرضا',
'زابل',
'یاسوج',
'میاندوآب',
'خرمشهر',
'مرند',
'جیرفت',
'بم',
'بهبهان',
'دورود',
'نظرآباد',
'محمدشهر',
'ایذه',
'بندرانزلی',
'اندیشه',
'ایرانشهر (شهر)',
'فسا',
'برازجان',
'بانه',
'چابهار',
'رباط کریم',
'کاشمر',
'شوشتر',
'قوچان',
'لاهیجان',
'اهر',
'مسجد سلیمان',
'تربت جام',
'ابهر',
'میانه',
'پرند',
'دوگنبدان',
'کازرون',
'بهشهر',
'الوند',
'پارس‌آباد',
'سلماس',
'شهرصدرا',
'پیرانشهر',
'اسلام‌آباد غرب',
'محمدیه',
'الیگودرز',
'کوهدشت',
'فولادشهر',
'بناب',
'باغستان',
'شیروان',
'سهند',
'نقده',
'میبد',
'تاکستان',
'لنگرود',
'بومهن',
'بهارستان',
'بندر امام خمینی',
'قروه',
'شوش',
'نهاوند',
'اردکان',
'رامهرمز',
'خمین',
'مشگین‌شهر',
'بندر گناوه',
'پردیس',
'میناب',
'داراب',
'مبارکه',
'امیدیه',
'نورآباد',
'فیروزآباد',
'آران و بیدگل',
'باقرشهر',
'چالوس',
'ماهدشت',
'لار',
'مشکین دشت',
'نکا',
'زرند',
'بندر کنگان',
'آبیک',
'سراوان',
'بابلسر',
'اسفراین',
'پیشوا',
'آباده',
'دامغان',
'گلپایگان',
'صالحیه',
'کامیاران',
'بروجن',
'نورآباد',
'دهدشت',
'خاش',
'تایباد',
'کوت عبدالله',
'زرین‌شهر',
'اسدآباد',
'هشتگرد',
'تنکابن',
'خرمدره',
'اقبالیه',
'جوانرود',
'هشتپر',
'صباشهر',
'بندر ترکمن',
'چناران',
'علی‌آباد کتول',
'کهنوج',
'حمیدیا',
'شهر بابک',
'آستارا',
'سوسنگرد',
'کنگاور',
'تویسرکان',
'بیجار',
'چهاردانگه',
'نی‌ریز',
'تکاب',
'نوشهر',
'چهارباغ',
'گرمسار',
'دماوند',
'درچه',
'ازنا',
'صومعه‌سرا',
'ماکو',
'سردشت',
'سرپل ذهاب',
'بافق',
'سراب',
'آستانه اشرفیه',
'آذرشهر',
'اقلید',
'سنقر',
'هرسین',
'حسن‌آباد',
'آزادشهر',
'کنارک',
'محلات',
'شاهین‌دژ',
'قائن',
'سرخس',
'شهر جدید هشتگرد',
'شادگان',
'دولت‌آباد',
'دلیجان',
'گناباد',
'خورموج',
'قشم',
'لردگان',
'کردکوی',
'کیش',
'اشنویه',
'طبس',
'فریمان',
'خلخال',
'فریدونکنار',
'رودسر',
'فلاورجان',
'کهریزک',
'گلبهار',
'درگز',
'استهبان',
'شیبان',
'کلاله',
'دهبارز',
'رامسر',
'فومن',
'صحنه',
'آق‌قلا',
'قیدار',
'بافت',
'گراش',
'هادی‌شهر',
'مهریز',
'قهدریجان',
'فردوسیه',
'دیواندره',
'عجب‌شیر',
'الشتر',
'چمران',
'وحیدیه',
'خواف',
'دهلران',
'جویبار',
'صفادشت',
'زرقان',
'محمودآباد',
'فرخ‌شهر',
'کوار',
'جم',
'ایوان',
'ان',
'امیرکلا',
'بندرلنگه',
'مینودشت',
'اشتهارد',
'سردرود',
'لامرد',
'خورزوق',
'هندیجان',
'حاجی‌آباد',
'گرمی',
'فردوس',
'بهار',
'نصیرشهر',
'رودهن',
'بردسکن',
'ابرکوه',
'ملکان',
'نائین',
'نور',
'سمیرم',
'صفاشهر',
'قائمیه',
'قره‌ضیاءالدین',
'پلدختر',
'باغ‌ملک',
'دهگلان',
'پاوه',
'بندر دیلم',
'کلیشاد و سودرجان',
'شاهدشهر',
'شوط',
'گل‌دشت',
'بردسیر',
'آشخانه',
'رامشیر',
'روانسر',
'مهدی‌شهر',
'گزبرخوار',
'گتوند',
'بندر دیر',
'آبدانان',
'گالیکش',
'عالی‌شهر',
'بروات',
'راور',
'گرمدره',
'ابریشم',
'غرب',
'شبستر',
'حمیدیه',
'محمودآباد نمونه',
'خسروشاه',
'دره‌شهر',
'خوانسار',
'مأمونیه',
'بستان‌آباد',
'تیران',
'فرون‌آباد',
'حاجی‌آباد',
'گلوگاه',
'هفشجان',
'شازند',
'طرقبه',
'خمام',
'بوئین‌زهرا',
'بندر گز',
'محمدآباد',
'کتالم و سادات‌شهر',
'هشترود',
'شریفیه',
'مهاجران',
'کبودرآهنگ',
'فراشبند',
'نجف‌شهر',
'داران',
'قیر',
        ];

        $result = [
            'paragraph' => collect(array_random($paragraphs, $number)),
            'sentence' => collect(array_random($sentences, $number)),
            'word' => collect(array_random($words, $number)),
            'province' => collect(array_random($province, $number)),
            'city' => collect(array_random($cities, $number)),
        ];

        return (object) $result;
    }
}
