<?php

if (! function_exists('omidFaker')) {
    function omidFaker($type = 'sentence', $number = 1)
    {
        $sentence = [
            'انسان از چند درصد مغز خود استفاده می کند؟',
            'خیلی از ما دوست داریم به این افسانه باور داشته باشیم چون نشانه قدرت فوق العاده مغز انسان است.',
            'بیایید با خودمان روراست باشیم،',
            'برای اثبات این ادعا لازم نیست به صفحات و کانال چندان معتبر تقویت ذهن در شبکه های اجتماعی اشاره کنیم',
            'دانشمندان اما با انجام مطالعات گسترده و ارائه شواهد تردید ناپذیر روی افسانه ۱۰ درصد یک خط قرمز پر رنگ کشیده',
            'عصب روانشناسی اثرگذاری آناتومی مغز بر رفتار، احساسات و قوای شناختی افراد را اثبات کرده اند.',
            'هیچ منطقه ای در مغز انسان پیدا نشده که کاملا غیر فعال باشد.',
        ];

        $result = '';
        for ($i = 0; $i < $number; $i++) {
            $result .= $$type[array_rand($$type)].' ';
        }

        return trim($result);
    }
}
